001400200326       IDENTIFICATION DIVISION.
001500200326       PROGRAM-ID.  MULTIPLIER.
001600200326       AUTHOR.  MICHAEL COUGHLAN.
001900200326       DATA DIVISION.
002000200326       WORKING-STORAGE SECTION.
002100200326       01  NUM1                                PIC 9  VALUE ZEROS.
002200200326       01  NUM2                                PIC 9  VALUE ZEROS.
002300200326       01  RESULT                              PIC 99 VALUE ZEROS.
002400200326       PROCEDURE DIVISION.
002501200326           DISPLAY "ENTER FIRST NUMBER (1 DIGIT)"
002502200326           ACCEPT NUM1
002700200326           DISPLAY "ENTER SECOND NUMBER (1 DIGIT)"
002701200326           ACCEPT NUM2
002900200326           MULTIPLY NUM1 BY NUM2 GIVING RESULT.
003000200326           DISPLAY "RESULT IS = ", RESULT.
003100200326           STOP RUN.
