000100950109     A          R ACTGLP                    TEXT('Minimum PF')
000200950109     A            FIELD1         1          TEXT('One byte field')
